app/views/messages/_message.html.erb

INSERT INTO "messages" ("content", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Hello!!!"], ["user_id", 538], ["event_id", 92], ["created_at", 2016-12-13 09:51:42 UTC], ["updated_at", 2016-12-13 09:51:42 UTC]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 538], ["LIMIT", 1]]
---
  <div class="message-bubble">
    <p class="msg-time"><strong><%= message.user.first_name %></strong> - <em><%= t('events.show.about', time: time_ago_in_words(message.created_at)) %></em></p>