app/views/users/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 536]]
---
  <% else %>
    <% @user.events.each do |event| %>