app/views/events/_messages_count.html.erb

<i class="fi-comments" style="color: #DA4167;"></i> <%= t("events.show.messages", count: event.messages.size, event: event.name) %>
---
SELECT COUNT(*) FROM "messages" WHERE "messages"."event_id" = $1  [["event_id", 89]]