app/views/events/show.html.erb

<% content_for :meta_title, "Inscrivez-vous à l'activité #{@event.name} créée par #{@event.user.first_name}" %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 536], ["LIMIT", 1]]