app/views/booking_mailer/reimbursement_status.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 544], ["LIMIT", 1]]
---
<p> <%= t('booking_mailer.reimbursement_status.hello', name: @booking.user.first_name.capitalize) %> </p>