app/views/booking_mailer/user_unsubscription.html.erb

<h1> <%= t('booking_mailer.user_unsubscription.hello', name: @event.user.first_name.capitalize) %> </h1>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 538], ["LIMIT", 1]]