app/views/booking_mailer/user_subscription.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 538], ["LIMIT", 1]]
---
<h1> <%= t('booking_mailer.user_subscription.hello', name: @event.user.first_name.capitalize) %> </h1>