app/views/payments/new.html.erb

            <h5><%= t('payments.new.activity_html', activity: @booking.event.name) %></h5>
            <h5><%= t('payments.new.organized_by_html', organizer: @booking.event.user.first_name) %></h5>
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 92], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 536], ["LIMIT", 1]]