app/views/event_mailer/event_updated.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 542], ["LIMIT", 1]]
---

<p> <%= t('event_mailer.event_updated.body', event_name: @event.name, organizer: @event.user.first_name.capitalize) %> </p>