app/views/event_mailer/event_cancelled.html.erb


<p> <%= t('event_mailer.event_cancelled.body', event_name: @event.name, organizer: @event.user.first_name.capitalize) %> </p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 537], ["LIMIT", 1]]