app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("user_id", "event_id", "created_at", "updated_at", "state", "amount_cents") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 536], ["event_id", 92], ["created_at", 2016-12-13 09:47:37 UTC], ["updated_at", 2016-12-13 09:47:37 UTC], ["state", "pending"], ["amount_cents", 1000]]
---
  def create
    @booking = Booking.new(booking_params)
    @booking.event = @event
    @booking.user = current_user
    @booking.amount = @event.price
    @booking.state = "pending"
    authorize @booking
    if @booking.on_waiting_list || @booking.amount == 0
      if @booking.save

UPDATE "bookings" SET "reimbursed" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["reimbursed", "reimbursed"], ["updated_at", 2016-12-13 10:33:25 UTC], ["id", 679]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 544], ["LIMIT", 1]]
---
  def update
    @booking.on_waiting_list = booking_params[:on_waiting_list]
    status = booking_params[:reimbursed]
    if status == t('events.show.accept_reimbursement')
      @booking.reimbursed = "reimbursed"
    elsif status == t('events.show.refuse_reimbursement')
      @booking.reimbursed = "reimbursement refused"
    else
      @booking.reimbursed = "pending"
    end
    if booking_params[:state]
      @booking.state = booking_params[:state]
      @booking.cancellation_message = booking_params[:cancellation_message]
    end
    if current_user == @booking.user
      @booking.cancelled = false
      @booking.save
      authorize @booking
      if @booking.state == "paid"
        flash[:notice] = t('controllers.bookings.subscription_after_cancellation')
        redirect_to current_user
      else
        redirect_to new_event_booking_payment_path(@booking.event, @booking)
      end
    else
      @booking.save
      authorize @booking
      flash[:notice] = t('controllers.bookings.reimbursement', name: @booking.user.first_name)

UPDATE "bookings" SET "cancelled" = $1, "cancellation_message" = $2, "updated_at" = $3 WHERE "bookings"."id" = $4  [["cancelled", true], ["cancellation_message", "ldshksfjh"], ["updated_at", 2016-12-13 09:37:59 UTC], ["id", 663]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 89], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 538], ["LIMIT", 1]]
---
  def destroy
    @booking.cancelled = true
    @booking.cancellation_message = params[:booking][:cancellation_message]
    @booking.save
    BookingMailer.user_unsubscription(current_user, @booking).deliver_now
    flash[:notice] = t('controllers.bookings.unsubscription', name: @booking.event.user.first_name)