app/controllers/events_controller.rb

  def create
    @event = current_user.events.new(event_params)

    if !@event.photo.present? && event_params[:photo].present?
      cloudinary_url = URI.parse(event_params[:photo])
      file = cloudinary_url.open
      @event.photo = file
    end

    authorize @event
    if @event.save
      EventMailer.event_created(current_user, @event).deliver_now
      @booking = Booking.new
      @booking.event = @event
      @booking.user = current_user
      @booking.state = 'paid'
      @booking.save
---
INSERT INTO "events" ("name", "description", "user_id", "max_participants", "location", "notif_subscription", "notif_message", "created_at", "updated_at", "latitude", "longitude", "starts_at", "ends_at", "price_cents", "photo") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
INSERT INTO "bookings" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 544], ["event_id", 92], ["created_at", 2016-12-13 09:47:14 UTC], ["updated_at", 2016-12-13 09:47:14 UTC]]

  def update
    @event.update(event_params)
    if @event.save
      @participants = @event.bookings.where(cancelled: false, on_waiting_list: false, state: 'paid').map(&:user)
---
UPDATE "events" SET "starts_at" = $1, "ends_at" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["starts_at", 2016-12-28 19:00:00 UTC], ["ends_at", 2016-12-29 21:00:00 UTC], ["updated_at", 2016-12-13 13:26:46 UTC], ["id", 99]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."event_id" = $1 AND "bookings"."cancelled" = $2 AND "bookings"."on_waiting_list" = $3  [["event_id", 99], ["cancelled", false], ["on_waiting_list", false]]

  def show
    @booking = Booking.new
    @duplicated_event = Event.new
    @participants = @event.bookings.where(cancelled: false, on_waiting_list: false, state: 'paid').map(&:user)
    @participants_number = @participants.count
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1 AND "bookings"."event_id" = 89 AND "bookings"."cancelled" = $2 ORDER BY "bookings"."id" ASC LIMIT $3  [["user_id", 544], ["cancelled", false], ["LIMIT", 1]]
SELECT COUNT(*) FROM "bookings" WHERE "bookings"."event_id" = $1 AND "bookings"."cancelled" = $2 AND "bookings"."on_waiting_list" = $3  [["event_id", 89], ["cancelled", false], ["on_waiting_list", false]]

  def destroy
    @event.active = false
    @participants = @event.bookings.where(cancelled: false, on_waiting_list: false, state: 'paid').map(&:user)
    @event.save
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."event_id" = $1 AND "bookings"."cancelled" = $2 AND "bookings"."on_waiting_list" = $3  [["event_id", 90], ["cancelled", false], ["on_waiting_list", false]]
UPDATE "events" SET "active" = $1, "photo" = $2, "updated_at" = $3 WHERE "events"."id" = $4  [["active", false], ["photo", "v1481622434/d1xn2ziw4l55wmta6mej.jpg"], ["updated_at", 2016-12-13 13:01:32 UTC], ["id", 92]]

  def set_user
    @user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 544], ["LIMIT", 1]]