app/controllers/messages_controller.rb

  def create
    @message = Message.new(message_params)
    @message.event = @event
    @message.user = current_user
    authorize @message
    if @message.save
---
INSERT INTO "messages" ("content", "user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "Hello!!!"], ["user_id", 538], ["event_id", 92], ["created_at", 2016-12-13 09:51:42 UTC], ["updated_at", 2016-12-13 09:51:42 UTC]]