app/controllers/payments_controller.rb

UPDATE "users" SET "stripe_customer_id" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["stripe_customer_id", "cus_9jgF8tSGpHHKwO"], ["updated_at", 2016-12-13 09:47:53 UTC], ["id", 536]]
UPDATE "bookings" SET "payment" = $1, "state" = $2, "updated_at" = $3 WHERE "bookings"."id" = $4
---
  def create
    stripe_customer_id = current_user.stripe_customer_id

    unless stripe_customer_id
      customer = Stripe::Customer.create(
       source: params[:stripeToken],
       email:  params[:stripeEmail]
      )

      stripe_customer_id = customer.id
      current_user.update(stripe_customer_id: stripe_customer_id)
    end

    charge = Stripe::Charge.create(
     customer:     stripe_customer_id,
     amount:       @booking.amount_cents, # or amount_pennies
     description:  t('controllers.payments.payment', activity = @booking.event.name),
     currency:     @booking.amount.currency
    )
    authorize @booking


    @booking.update(payment: charge.to_json, state: 'paid')

SELECT  "bookings".* FROM "bookings" WHERE "bookings"."state" = $1 AND "bookings"."id" = $2 LIMIT $3  [["state", "pending"], ["id", 678], ["LIMIT", 1]]
---
  def set_booking
    @booking = Booking.where(state: "pending").find(params[:booking_id])