app/controllers/users_controller.rb

SELECT "bookings".* FROM "bookings" INNER JOIN "events" ON "events"."id" = "bookings"."event_id" WHERE "bookings"."user_id" = $1 AND (events.active = 't' AND bookings.cancelled = 'f')  [["user_id", 2]]
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 536]]
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1  [["user_id", 536]]
---
  def show
    @booking = Booking.new
    @duplicated_event = Event.new
    # Tous les bookings en cours de l'user (yc. lorsqu'il organise ou lorsqu'il est en liste d'attente)
    @all_bookings_active = @user.bookings.joins(:event).where("events.active = ? AND bookings.cancelled = ?", true, false)
    # Tous les bookings en cours de l'user à venir
    @bookings_active_to_come = @all_bookings_active.select do |booking|